{
  "personalInfo": {
    "name": "Alvin Jorrel Pascual",
    "title": ".NET Developer & DevOps Specialist",
    "intro": "A .NET developer with over a decade's worth of experience and with strong DevOps skills as well. Passionate about building scalable applications and streamlining development pipelines."
  },
  "blogPosts": [
    {
      "slug": "setting-up-pi-hole",
      "title": "Setting up Pi-hole at home to block ads",
      "summary": "A step-by-step guide to reclaiming your network and blocking advertisements on all your devices with Pi-hole."
    },
    {
      "slug": "nextjs-vs-blazor",
      "title": "Next.js vs Blazor: A .NET Developer's Perspective",
      "summary": "Comparing two powerful frameworks for building modern web applications from the viewpoint of a seasoned C# developer."
    },
    {
      "slug": "dotnet-10-news",
      "title": "What's New in .NET 10?",
      "summary": "A look into the future of the .NET ecosystem and the most anticipated features in the upcoming .NET 10 release."
    }
  ],
  "resume": {
    "summary": "Senior Software Engineer and technical leader with 11 years of experience specializing in .NET and building high-performing, maintainable systems. I thrive on leading complex architectural initiatives, from strategically consolidating microservices into a streamlined .NET monolith to migrating critical identity providers to modern platforms like Clerk. My focus is always on enhancing system performance while reducing operational overhead.\n\nRecently, I've championed a major leap in developer productivity by pioneering the integration of AI-powered tools like GitHub Copilot, cutting feature development cycles from weeks to days. I'm passionate about fostering a culture of quality, which I've driven by implementing comprehensive unit and integration testing strategies and taking formal ownership of code quality for core APIs. Ultimately, I love building efficient systems and empowering development teams with the optimized tools and processes they need to succeed.",
    "contact": {
      "email": "me@ajx.codes",
      "linkedin": "linkedin.com/in/alvinjorrel",
      "github": "github.com/ajxcodes"
    },
    "skills": [
      {
        "category": "Languages & Frameworks",
        "items": [
          "C#",
          ".NET (Framework, .NET 6+, MAUI)",
          "ASP.NET (MVC, Web API)",
          "TypeScript",
          "Angular",
          "Vue.js"
        ]
      },
      {
        "category": "Architecture & DevOps",
        "items": [
          "Microservices",
          "Docker",
          "Kubernetes",
          "Azure DevOps CI/CD",
          "Event Modelling",
          "CI/CD Pipelines"
        ]
      },
      {
        "category": "Databases & Data",
        "items": [
          "PostgreSQL",
          "SQL Server",
          "MySQL",
          "Dapper",
          "ETL"
        ]
      },
      {
        "category": "Scripting & T-SQL",
        "items": ["Scripting", "T-SQL"]
      },
      {
        "category": "Principles & Methodologies",
        "items": [
          "SOLID Design",
          "Domain-Driven Design (DDD)",
          "Test-Driven Development (TDD)",
          "Agile/Scrum/Kanban"
        ]
      }
    ],
    "experience": [
      {
        "company": "Provision Analytics",
        "role": "Senior Software Developer",
        "period": "March 2023 – Present",
        "skills": [
          "C#",
          ".NET (Framework, .NET 6+, MAUI)",
          "ASP.NET (MVC, Web API)",
          "Microservices",
          "Docker",
          "Test-Driven Development (TDD)"
        ],
        "results": [
          "Architected and led major backend modernizations, including consolidating 11 microservices into a .NET monolith and migrating the Identity Provider to Clerk, which enhanced performance and eliminated maintenance overhead.",
          "Pioneered the integration of AI-powered tools (GitHub Copilot) and automated PR reviews, cutting feature development cycles from weeks to days and elevating code quality standards across the team.",
          "Championed a culture of quality by implementing comprehensive testing strategies, including both unit (2,000+ tests) and integration testing, and assuming formal code ownership of the core API.",
          "Optimized the end-to-end development lifecycle by containerizing 15 applications with Docker and overhauling the local environment, accelerating new developer onboarding from days to hours."
        ]
      },
      {
        "company": "Symend",
        "role": "Senior Software Engineer",
        "period": "March 2022 – March 2023",
        "results": [
          "Architected and implemented a multi-branch tree structure within the core Campaign microservice (.NET), enabling complex, non-linear customer journey modeling for key enterprise clients.",
          "Dramatically improved API performance by designing and implementing a multi-level caching strategy, which significantly reduced latency on frequently accessed data.",
          "Enhanced development lifecycle and test reliability by creating a new integration testing framework using disposable Docker containers, leading to more consistent and faster builds.",
          "Led targeted research spikes to de-risk new technologies, driving the successful adoption of new production libraries and informing key architectural decisions for the team."
        ],
        "skills": [
          "C#",
          ".NET (Framework, .NET 6+, MAUI)",
          "Microservices",
          "Docker",
          "Test-Driven Development (TDD)",
          "SOLID Design",
          "Domain-Driven Design (DDD)"
        ]
      },
      {
        "company": "PurelyHR",
        "role": "Senior Software Developer",
        "period": "April 2021 – March 2022",
        "skills": [
          "C#",
          ".NET (Framework, .NET 6+, MAUI)",
          "Microservices",
          "Docker",
          "Kubernetes",
          "SOLID Design",
          "Domain-Driven Design (DDD)"
        ],
        "results": [
          "Architected and initiated the migration from a monolithic application to a microservice-based architecture, utilizing Docker and Kubernetes for containerized deployment.",
          "Led the development of a cross-platform mobile application (Android/iOS) using .NET MAUI, successfully transitioning from Ionic to leverage existing C# expertise.",
          "Championed the adoption of SOLID and Domain-Driven Design (DDD) principles, enhancing code maintainability and establishing best practices for the team."
        ]
      },
      {
        "company": "thirdstream",
        "role": "Software Engineer",
        "period": "September 2018 – March 2021",
        "skills": [
          "C#",
          "ASP.NET (MVC, Web API)"
        ],
        "results": [
          "Led the production release of 5 custom digital account onboarding implementations and developed 3 new central APIs for key financial services clients.",
          "Onboarded and coached 5 new developers, fostering their independence and productivity within the first three months."
        ]
      },
      {
        "company": "Purdys Chocolatier",
        "role": "Software Developer",
        "period": "September 2015 – September 2018",
        "skills": [
          "C#",
          ".NET (Framework, .NET 6+, MAUI)",
          "CI/CD Pipelines",
          "Azure DevOps CI/CD",
          "ETL",
          "Scripting"
        ],
        "results": [
          "Architected and implemented a full CI/CD pipeline (JIRA -> BitBucket -> VSTS -> Octopus Deploy) for .NET applications, significantly reducing deployment time and manual errors.",
          "Successfully migrated all customer and order data to a new eCommerce platform (Aptos), utilizing automated ETL scripting to ensure 100% data integrity."
        ]
      }
    ],
    "previousExperience": [
      {
        "role": "Software Developer",
        "company": "Civica Infrastructure Inc.",
        "location": "Vaughan, ON",
        "period": "Dec 2014 - Apr 2015"
      },
      {
        "role": "Information Technology Specialist",
        "company": "Crosslink Technology Inc.",
        "location": "Mississauga, ON",
        "period": "Mar 2014 - Nov 2014"
      },
      {
        "role": "IT Analyst (Co-op)",
        "company": "Milton Hydro Distribution Inc.",
        "location": "Milton, ON",
        "period": "Apr 2013 - Dec 2013"
      },
      {
        "role": "Technical Systems Analyst (Co-op)",
        "company": "RBC",
        "location": "Toronto, ON",
        "period": "Jan 2012 - Dec 2012"
      }
    ]
  }
}